southAmerica = {
    'text': 'Образование суверенных государств на южноамериканском континенте начинается с 1811 года, когда свою '
            'независимость от Испании провозгласила Венесуэла. Следующей стала Колумбия (1819 год) и затем Бразилия '
            '(1822 год). В настоящее время в Южной Америке 12 независимых государств, а также мы внесли в список '
            'Республику Тринидад и Тобаго, расположенную на островах близ Венесуэлы.',
    'countries': {
        'ARG': {
            'name': 'Аргентина',
            'capital': 'Буэнос-Айрес',
            'flag': 'source\\flags\\southAmerica\\argentina.png',
            'text': 'Флаг Аргентины придумал адвокат, политик и генерал Мануэль Бельграно. На представленном эскизе'
                    ' были расчерчены три горизонтальные полосы – две голубые одна белая. Позже, в 1816-м, в центр флага '
                    'поместили изображение «майского солнца» желтого цвета (или как говорят по-испански, Sol de Mayo). '
                    'Знак выбран в честь Бога солнца, которому поклонялись инки. А «майским» оно стало в честь майской '
                    'революции.',
        },
        'BOL': {
            'name': 'Боливия',
            'capital': 'Сукре',
            'flag': 'source\\flags\\southAmerica\\bolivia.png',
            'text': 'Хочешь узнать еще больше интересного? Прочитай про '
                    'Гимн Боливии прямо сейчас!',
        },
        'BRA': {
            'name': 'Бразилия',
            'capital': 'Бразилиа',
            'flag': 'source\\flags\\southAmerica\\brazil.png',
            'text': 'История Бразилии полна яркими неожиданными поворотами и сюрпризами. Несмотря на богатство и '
                    'насыщенность событиями, первый государственный флаг страна получила лишь в 1889-м, с момента, '
                    'когда получила независимость от иноземных поработителей, и стала независимой.',
        },
        'VEN': {
            'name': 'Венесуэла',
            'capital': 'Каракас',
            'flag': 'source\\flags\\southAmerica\\ve.png',
            'text': 'Красная полоса символизирует кровавое испанское владычество. Синяя полоса – Атлантический океан, '
                    'разделяющий Америку и Испанию. 7 звезд – это семь провинций Венесуэлы: Каракас, Баринас, '
                    'Барселона, Кумана, Маргарита, Мерида и Трухильо. 8-ая звезда появилась в 2006 году.',
        },
        'GUY': {
            'name': 'Гайана',
            'capital': 'Джорджтаун',
            'flag': 'source\\flags\\southAmerica\\guyana.png',
            'text': 'Зеленый цвет символизирует леса Гайаны, растительность и сельское хозяйство. Золотая (желтая) '
                    'стрела представляет минеральные богатства страны и ее золотое будущее. Красный цвет означает '
                    'рвение страны и ее энтузиазм, которые нужны, чтобы охватить процесс государственного '
                    'строительства.',
        },
        'COL': {
            'name': 'Колумбия',
            'capital': 'Богота',
            'flag': 'source\\flags\\southAmerica\\colombia.png',
            'text': 'Горизонтальные линии (сверху вниз) жёлтого, синего и красного цветов имеют пропорции 2:1:1. '
                    'Подобно флагу Эквадора, он произошёл от флага Великой Колумбии, отличающегося от большинства '
                    'триколоров (как горизонтальных, так и вертикальных) тем, что имеет полосы не равного размера.',
        },
        'PRY': {
            'name': 'Парагвай',
            'capital': 'Асунсьон',
            'flag': 'source\\flags\\southAmerica\\paraguay.png',
            'text': 'Флаг Парагвая был принят 27 ноября 1842 года, что делает его одним из старейших флагов в мире. '
                    'Парагвай получил независимость от Испании 15 мая 1811 года. Появление эмблемы на каждой из сторон '
                    'флага восходит к тому времени, когда Хосе-де-Франция был у власти с 1814-1840.',
        },
        'PER': {
            'name': 'Перу',
            'capital': 'Лима',
            'flag': 'source\\flags\\southAmerica\\peru.png',
            'text': 'День Государственного флага Перу отмечается 7 июня. Белый цвет символизирует мир, достоинство и '
                    'прогресс, красный — войну и храбрость. Согласно легенде, генерал Хосе де Сан-Мартин, появившись в '
                    'Перу в 1820 году, увидел много фламинго.',
        },
        'SUR': {
            'name': 'Суринам',
            'capital': 'Парамарибо',
            'flag': 'source\\flags\\southAmerica\\suriname.png',
            'text': 'Госуда́рственный флаг Сурина́ма — принят 25 ноября 1975 года. Имеет пропорции 2:3. Зелёный цвет — '
                    'символ плодородия и разнообразия суринамской земли, а также ожидание светлого будущего, Белые '
                    'полосы— символизируют справедливость и свободу, красный цвет — прогресса и возрождения посредством'
                    ' труда нации.',
        },
        'TTO': {
            'name': 'Тринидад и Тобаго',
            'capital': 'Порт-оф-Спейн',
            'flag': 'source\\flags\\southAmerica\\trinidad-tobago.png',
            'text': 'Белый цвет олицетворяет Карибское море и Атлантический океан, а также чистоту устремлений и '
                    'равенство всех людей под Солнцем. Чёрный цвет символизирует связь всех людей Тринидада и Тобаго, '
                    'единство цели и богатство земли.',
        },
        'URY': {
            'name': 'Уругвай',
            'capital': 'Монтевидео',
            'flag': 'source\\flags\\southAmerica\\uruguay.png',
            'text': 'Флаг Уругва́я во многом схож с флагом Аргентины, так как Уругвай входил в состав Аргентины до '
                    'приобретения независимости. Первоначальный вариант флага был учреждён в 1828 году с девятью '
                    'голубыми и десятью белыми полосами. В 1830 году количество полос было уменьшено до девяти '
                    '(четыре синие и пять белых).',
        },
        'CHL': {
            'name': 'Чили',
            'capital': 'Сантьяго',
            'flag': 'source\\flags\\southAmerica\\chile.png',
            'text': 'Авторство над флагом Чили принадлежит военному инженеру Антонио Аркосу, активному участнику '
                    'вооруженной борьбы за независимость страны и ее освобождение от колонизаторов. Внешний вид полотна'
                    ' официально утвердили в 1817-м, в год, когда чилийские освободители в ходе кровопролитных боев'
                    ' окончательно разгромили испанцев и отвоевали себе суверенитет. С тех пор прошло более 200 лет. '
                    'Внешность флага за два века практически не изменилась.',
        },
        'ECU': {
            'name': 'Эквадор',
            'capital': 'Кито',
            'flag': 'source\\flags\\southAmerica\\ecuador.png',
            'text': 'Красный на флаге Эквадор представляет кровь, пролитую солдатами и мучениками в боях за '
                    'независимость. Синий цвет означает цвет моря и неба, в то время как желтый символизирует изобилие'
                    ' и плодородие сельскохозяйственных культур и земли страны.',
        }
    }
}

northAmerica = {
    'text': 'Северная Америка вместе с Южным материком составляют одну часть света. На ее территории располагается 23 '
            'независимых государства и столько же зависимых территорий, которые представлены в основном островными '
            'образованиями.',
    'countries': {
        'ATG': {
            'name': 'Антигуа и Барбуда',
            'capital': 'Сент-Джонс',
            'flag': 'source\\flags\\northAmerica\\antigua-barbuda.png',
            'text': 'Флаг Антигуа и Барбуды отражает основные ценности, которые поддерживает правительство страны. '
                    'Черная полоса наверху символизирует африканское происхождение большей части ее жителей, две '
                    'следующие полосы - синяя и белая - море и пляжи, а восходящее солнце - новую эпоху в жизни '
                    'страны.',
        },
        'BHS': {
            'name': 'Багамские острова',
            'capital': 'Нассау',
            'flag': 'source\\flags\\northAmerica\\bahamas.png',
            'text': 'Государственный флаг Багамских Островов принят 10 июля 1973 года, с обретением независимости '
                    'колонии. Предшествующий был вариантом британского Юнион Джек с гербом губернатора. Чёрный '
                    'равносторонний треугольник символизирует единство и решимость багамцев.',
        },
        'BRB': {
            'name': 'Барбадос',
            'capital': 'Бриджтаун',
            'flag': 'source\\flags\\northAmerica\\barbados.png',
            'text': 'Синие полосы символизируют море, а желтые – песок, то есть землю. Черный трезубец – символ '
                    'демократии, барбадосского правительства и его принципов: «из народа, с народом, для народа». В то '
                    'же время трезубец – символ бога моря, Нептуна. Есть и другое толкование, которое связывает '
                    'трезубец с колониальным прошлым страны.',
        },
        'BLZ': {
            'name': 'Белиз',
            'capital': 'Бельмопан',
            'flag': 'source\\flags\\northAmerica\\bz.png',
            'text': 'В 1919 году был принят новый флаг, являвшийся государственным символом до 1981 года, когда была '
                    'объявлена независимость Белиза. Изображение на гербе напоминает о лесозаготовительной '
                    'промышленности, и привела к освоению колонии британцами. Это такие элементы как фигуры, '
                    'инструменты и деревья из красного дерева.',
        },
        'HTI': {
            'name': 'Гаити',
            'capital': 'Порт-о-Пренс',
            'flag': 'source\\flags\\northAmerica\\ht.png',
            'text': 'Синий цвет стал означать чернокожих граждан Гаити, а красный — мулатов (gens de couleur). Эта '
                    'история широко известна на Гаити: годовщина соответствующей даты отмечается как День флага и '
                    'университетов, а изображения Катрин Флон появились на гаитянских марках и валюте (гурдах).',
        },
        'GTM': {
            'name': 'Гватемала',
            'capital': 'Гватемала',
            'flag': 'source\\flags\\northAmerica\\guatemala.png',
            'text': 'Белый цвет символизирует честность и чистоту, голубой — законность и справедливость. Две '
                    'небесно-голубые полосы обозначают географию страны, поскольку Гватемала — это земля, расположенная'
                    ' между двумя океанами, Тихим океаном и Атлантическим океаном и небо над страной',
        },
        'HND': {
            'name': 'Гондурас',
            'capital': 'Тегусигальпа',
            'flag': 'source\\flags\\northAmerica\\honduras.png',
            'text': 'Голубые полосы символизируют Карибское море и Тихий океан, омывающие Гондурас. Пять голубых звёзд '
                    'означают пять стран, ранее входивших в Центрально-Американскую федерацию, их тесно связанную '
                    'историю.',
        },
        'GRD': {
            'name': 'Гренада',
            'capital': 'Сент-Джорджес',
            'flag': 'source\\flags\\northAmerica\\grenada.png',
            'text': 'Был принят в 1974 году для замены временного флага, использовавшегося со времени, когда острова '
                    'стали ассоциированным государством Соединенного Королевства. Жёлтый цвет символизирует солнце над '
                    'Гренадой и дружелюбие её граждан, зелёный — сельское хозяйство, красный — гармонию, единство и '
                    'мужество.',
        },
        'DOM': {
            'name': 'Доминиканская Республика',
            'capital': 'Санто-Доминго',
            'flag': 'source\\flags\\northAmerica\\do.png',
            'text': 'На флаге Доминиканской республики – красные и синие прямоугольники, разделенные крестом. Красный '
                    'цвет символизирует борьбу, синий – свободу, белый – силу народа. В центре флага – герб, а в '
                    'середине герба – Библия.',
        },
        'DMA': {
            'name': 'Доминика',
            'capital': 'Розо',
            'flag': 'source\\flags\\northAmerica\\dominica.png',
            'text': 'Зелёный цвет фона флага Доминики символизирует тропическую природу, красный цвет в центре флага '
                    'символ свободы, 10 зелёных пятиконечных звёзд — 10 приходов страны. Святую Троицу символизирует '
                    'крест из трёх полос: белый — европеоиды, золотой — мулаты, чёрный — негры.',
        },
        'CAN': {
            'name': 'Канада',
            'capital': 'Оттава',
            'flag': 'source\\flags\\northAmerica\\canada.png',
            'text': 'Кленовый лист является символом Канады с 18-го века. Самый большой канадский флаг, который '
                    'когда-либо был изготовлен, был 38 метров в ширину и 76 метров в длину. Обошёлся такой стяг в '
                    '$15,000.',
        },
        'CRI': {
            'name': 'Коста-Рика',
            'capital': 'Сан-Хосе',
            'flag': 'source\\flags\\northAmerica\\costa-rica.png',
            'text': 'Цвета флага Коста-Рики имеют для страны определенные значения: синий цвет представляет собой небо,'
                    ' интеллектуальное мышление, настойчивость, бесконечность, вечность, а также духовные и '
                    'религиозные идеалы, белый цвет символизирует ясное мышление, счастье, мудрость, силу и красоту '
                    'неба, инициативу поиска новых начинаний',
        },
        'CUB': {
            'name': 'Куба',
            'capital': 'Гавана',
            'flag': 'source\\flags\\northAmerica\\cuba.png',
            'text': 'По официальной версии кубинского правительства, символика флага означает: три синие полосы — три '
                    'части, на которые разделили Кубу испанцы; две белые полосы — стремление к независимости; красный '
                    'треугольник — равенство, братство и свободу, а также пролитую кровь в борьбе за независимость '
                    'острова; белая звезда символизирует свободу.',
        },
        'MEX': {
            'name': 'Мексика',
            'capital': 'Мехико',
            'flag': 'source\\flags\\northAmerica\\mx.png',
            'text': 'Зелёный цвет флага обозначает надежду, а также изобилие хорошей почвы Мексики. Белый символизирует'
                    ' чистоту, красный — кровь, пролитую за независимость страны. Флаг принят 16 сентября 1968 года. 24'
                    ' февраля в Мексике празднуется День флага.',
        },
        'NIC': {
            'name': 'Никарагуа',
            'capital': 'Манагуа',
            'flag': 'source\\flags\\northAmerica\\nicaragua.png',
            'text': 'Треугольник означает равенство. Пять вулканов — пять наций Центральной Америки, лежащей между '
                    'Атлантическим и Тихим океаном. Фригийский колпак — свобода, радуга — мир.',
        },
        'PAN': {
            'name': 'Панама',
            'capital': 'Панама',
            'flag': 'source\\flags\\northAmerica\\panama.png',
            'text': ' Синий и красный цвета представляют Консервативную и Либеральную партии Панамы. Кроме того, синий'
                    ' цвет символизирует Тихий океан и Карибское море, а красный — пролитую при защите страны кровь.',
        },
        'SLV': {
            'name': 'Сальвадор',
            'capital': 'Сан-Сальвадор',
            'flag': 'source\\flags\\northAmerica\\sv.png',
            'text': 'Государственный флаг Сальвадора представляет собой прямоугольное полотнище состоящее из трёх '
                    'полос: синей, белой и синей. В центре флага расположен герб Сальвадора. На гербе есть треугольник,'
                    ' символизирующий равенство, его углы — три ветви власти — законодательную, исполнительную и '
                    'судебную. Вулканы олицетворяют пять наций Центральной Америки, лежащей между Тихим и Атлантическим'
                    ' океанами. Внутри треугольника фригийский колпак — символ свободы, золотые лучи — идеалы народа и'
                    ' радуга — знак мира. 14 пучков листьев отражают число провинций Сальвадора.',
        },
        'VCT': {
            'name': 'Сент-Винсент и Гренадины',
            'capital': 'Кингстаун',
            'flag': 'source\\flags\\northAmerica\\sv.png',
            'text': 'Синий олицетворяет небо и море, в то время как золотой олицетворяет цвет островного песка, '
                    'солнечный свет и «светлый дух» островитян. Зеленый цвет символизирует обильную растительность '
                    'страны, а также жизненную силу коренного населения. Три алмаза связаны с прозвищами Сент-Винсента '
                    '«Жемчужина Антильских островов» и «Драгоценность Карибского моря». Их расположение в форме буквы V'
                    ' связано с первой букве в слове «Винсент», они незначительно смещены вниз от центра, '
                    'что указывает на географическое положение островов в Карибском море.',
        },
        'KNA': {
            'name': 'Сент-Китс и Невис',
            'capital': 'Бастер',
            'flag': 'source\\flags\\northAmerica\\kn.png',
            'text': 'Официальное значение двух звёзд на флаге Сен-Китс и Невис — свобода и надежда. Самая высокая точка'
                    ' островов — расположенный на одноимённом острове вулкан Невис высотой чуть менее километра. Оба '
                    'острова окружены многочисленными коралловыми рифами, которые представляют опасность для судов.',
        },
        'LCA': {
            'name': 'Сент-Люсия',
            'capital': 'Кастри',
            'flag': 'source\\flags\\northAmerica\\lc.png',
            'text': 'Символически это сочетание цветов флага означает остров, окруженный морем. Небесно-голубой цвет '
                    'флага символизирует верность. Треугольники, устремленные вверх - две горы вулканического массива '
                    'Питон (Грос-Питон и Пти-Питон), которые являются официальным символом Сент-Люсии - отражают '
                    'надежды и чаяния народа. Желтый треугольник обозначает солнце. Черный треугольник, окантованный '
                    'белыми полосами - мирное сосуществование людей черной и белой расы, живущих и работающих в '
                    'единстве.',
        },
        'USA': {
            'name': 'США',
            'capital': 'Вашингтон',
            'flag': 'source\\flags\\northAmerica\\united-states.png',
            'text': 'Синий крыж символизирует Союз. Число звёзд в синем крыже соответствует числу штатов (в настоящее '
                    'время их 50). Красный цвет олицетворяет выносливость и доблесть; тёмно-синий — усердие, '
                    'справедливость, бдительность; белый — невинность и чистоту.',
        },
        'JAM': {
            'name': 'Ямайка',
            'capital': 'Кингстон',
            'flag': 'source\\flags\\northAmerica\\jamaica.png',
            'text': 'Флаги Ямайки и Ливии - единственные в мире, в которых не используется ни один из цветов триколора '
                    '(белый, синий и красный). Цвета ямайского флага символизируют девиз: «Трудности есть, но земля '
                    'зелена и солнце сияет».',
        },
    }
}

oceania = {
    'text': 'В список мы включили Австралию, поскольку в большинстве случае она вместе с Океанией выделяется в единую '
            'часть света. Несмотря на относительную близость к австралийскому континенту, Океания географически '
            'представляет собой изолированное скопление вулканических островов, на территории которых расположено 25 '
            'стран, из которых 18 являются суверенными государствами. Материк Австралия и крупные острова считаются '
            'остатками континентальной суши.',
    'countries': {
        'AUS': {
            'name': 'Австралия',
            'capital': 'Канберра',
            'flag': 'source\\flags\\oceania\\australia.png',
            'text': 'Шесть белых звезд – это шесть австралийских штатов. Самая большая звезда символизирует '
                    'принадлежность Австралии к Британскому Содружеству. Пять звезд, расположенных в правой половине '
                    'флага, образуют созвездие Южного Креста, что символизирует расположение Австралии в Южном '
                    'полушарии.',
        },
        'VUT': {
            'name': 'Вануату',
            'capital': 'Порт-Вила',
            'flag': 'source\\flags\\oceania\\vu.png',
            'text': 'Жёлтая Y-образная фигура символизирует свет Евангелия, освещающий острова Тихого океана (в Вануату'
                    ' около 90 % христиан). Жёлтая эмблема на чёрном фоне — кабаний клык — символ благополучия, носимый'
                    ' на островах как талисман, и два листа местного папоротника намеле.',
        },
        'TLS': {
            'name': 'Восточный Тимор',
            'capital': 'Дили',
            'flag': 'source\\flags\\oceania\\timor-leste.png',
            'text': 'Согласно конституции Республики Тимор-Лешти жёлтый треугольник означает следы колониализма в '
                    'истории страны. Чёрный треугольник означает трудности, которые нужно преодолеть. Красный цвет '
                    'означает борьбу за свободу. Звезда — путеводный свет, белый цвет звезды — мир.',
        },
        'IDN': {
            'name': 'Индонезия',
            'capital': 'Джакарта',
            'flag': 'source\\flags\\oceania\\indonesia.png',
            'text': 'Такому окрасу своего стяга страна обязана королевству Маджапахит, которое было на пике славы в 14'
                    ' веке. После окончания Второй мировой войны Индонезия провозгласила свою независимость (в августе'
                    ' 45 года), и с тех пор флаг считается государственной символикой.',
        },
        'KIR': {
            'name': 'Кирибати',
            'capital': 'Южная Тарава',
            'flag': 'source\\flags\\oceania\\kiribati.png',
            'text': 'Флаг Кирибати представляет собой прямоугольное полотнище со стилистическими волнами белого и '
                    'синего цветов в нижней части флага и восходящим солнцем, парящим большим фрегатом на красном фоне.'
                    ' Флаг был принят 12 июля 1979 года. Он имеет соотношение сторон 1:2. Автором флага принято считать'
                    ' Артура Гримбла.',
        },
        'MHL': {
            'name': 'Маршалловы острова',
            'capital': 'Маджуро',
            'flag': 'source\\flags\\oceania\\marshall-islands.png',
            'text': 'Синий цвет символизирует Тихий океан, в каком находится архипелаг. Белый – рвение к миру во всём '
                    'мире. Оранжевый – о храбрости и мужественности населения. белая звезда свидетельствует '
                    'христианский крест, а её лучи – число избирательных округов в стране. Она же размещена на гербе и '
                    'печати страны. Две полосы означают две цепочки островов, находящихся в составе архипелага, – Ратак'
                    ' и Ралик.',
        },
        'NRU': {
            'name': 'Науру',
            'capital': 'Ярен',
            'flag': 'source\\flags\\oceania\\nauru.png',
            'text': 'Желтая полоса символизирует экватор. Звезда обозначает местоположение страны по отношению к '
                    'экватору. 12 концов звезды символизируют 12 племен Науру. Синий цвет обозначает Тихий океан.',
        },
        'NIU': {
            'name': 'Ниуэ',
            'capital': 'Алофи',
            'flag': 'source\\flags\\oceania\\niue.png',
            'text': 'Золотисто-жёлтый цвет полотна флага символизирует тёплые чувства, испытываемые жителями Ниуэ к'
                    ' Новой Зеландии и её гражданам.',
        },
        'NZL': {
            'name': 'Новая Зеландия',
            'capital': 'Веллингтон',
            'flag': 'source\\flags\\oceania\\new-zealand.png',
            'text': 'Флаг Но́вой Зела́ндии представляет собой изменённый кормовой флаг с Юнион Джеком в левой верхней '
                    'четверти и четырьмя красными звёздами с белой окантовкой в правой части. Звёзды имеют разный '
                    'размер и символизируют созвездие Южный крест. Юнион Джек символизирует связь с Великобританией.',
        },
        'COK': {
            'name': 'Острова Кука',
            'capital': 'Аваруа',
            'flag': 'source\\flags\\oceania\\cook-islands.png',
            'text': 'Государственный флаг Островов Ку́ка — принят 4 августа 1979 года. Состоит из 15 звёзд на флаге Blue'
                    ' Ensign. Флаг Великобритании в левом верхнем углу символизирует тесные исторические связи Островов'
                    ' Кука с Соединённым Королевством. Звёзды представляют 15 островов государства.',
        },
        'PLW': {
            'name': 'Палау',
            'capital': 'Нгерулмуд',
            'flag': 'source\\flags\\oceania\\palau.png',
            'text': 'Синий цвет символизирует океан и место нации в нём. Это роднит флаг Палау с флагами многих других'
                    ' островных государств, в частности, с флагом Федеративных Штатов Микронезии. В то же время круг, '
                    'смещенный влево от центра флага, схож с кругом на флаге Бангладеш, однако он олицетворяет в данном'
                    ' случае не солнце, а луну.',
        },
        'PNG': {
            'name': 'Папуа — Новая Гвинея',
            'capital': 'Порт-Морсби',
            'flag': 'source\\flags\\oceania\\papua-new-guinea.png',
            'text': 'На чёрном поле изображено созвездие Южный Крест — легко узнаваемый астеризм, означающий, что '
                    'страна находится в Южном полушарии, на красном — летящая райская птица, встречающаяся почти только'
                    ' в Новой Гвинее. Соотношение сторон флага — 3:4. Флаг был создан пятнадцатилетней школьницей '
                    'Сьюзен Харехо Карике.',
        },
        'WSM': {
            'name': 'Самоа',
            'capital': 'Апиа',
            'flag': 'source\\flags\\oceania\\america-samoa.png',
            'text': 'Красный фон представляет мужество. Синий цвет означает свободу. Белый цвет символизирует чистоту. '
                    'Пять звезд символизируют созвездие Южного Креста, которое представлено звездами альфа, бета, '
                    'гамма, дельта и эпсилон, которая меньше, потому что она не светит так же ярко, как и другие звезды'
                    ' в созвездии.',
        },
        'SLB': {
            'name': 'Соломоновы острова',
            'capital': 'Хониара',
            'flag': 'source\\flags\\oceania\\solomon-islands.png',
            'text': 'Синий цвет символизирует внутренние воды и окружающий океан. Зелёный цвет олицетворяет плодородную'
                    ' землю страны. Жёлтый цвет символизирует солнечный свет.',
        },
        'TON': {
            'name': 'Тонга',
            'capital': 'Нукуалофа',
            'flag': 'source\\flags\\oceania\\tonga.png',
            'text': 'Флаг Тонга связан с религией. На одном из ранних его вариантов изображался красный крест посреди '
                    'белого полотна. Белый цвет символизировал чистоту, а красный – кровь, пролитую во время распятия '
                    'Иисуса.',
        },
        'TUV': {
            'name': 'Тувалу',
            'capital': 'Фунафути',
            'flag': 'source\\flags\\oceania\\tuvalu.png',
            'text': 'На флаге также изображены девять жёлтых звёзд, символизирующих девять коралловых атоллов, из '
                    'которых состоит государство. Расположение звёзд на флаге повторяет расположение островов на карте,'
                    ' если севером считать левую сторону флага.',
        },
        'FSM': {
            'name': 'Федеративные Штаты Микронезии',
            'capital': 'Паликир',
            'flag': 'source\\flags\\oceania\\fm.png',
            'text': 'Голубой цвет флага символизирует Тихий океан, посреди которого разбросаны острова Микронезии, а '
                    'четыре одинаковые звезды — это четыре штата страны, четыре составляющие бывшей подопечной '
                    'территории ООН Тихоокеанские острова, которые в 1979 образовали федерацию: островные группы Яп, '
                    'Косраэ, Понпеи и Чуук (Трук).',
        },
        'FJI': {
            'name': 'Фиджи',
            'capital': 'Сува',
            'flag': 'source\\flags\\oceania\\fiji.png',
            'text': 'Флаг Великобритании символизирует историческую связь страны со своей бывшей метрополией. Сахарный '
                    'тростник, бананы, кокосовые пальмы составляют основу экономики Фиджи. Голубь символизирует мир. '
                    'Голубой цвет флага символизирует Тихий океан.',
        }
    }
}

eur = {
    'text': 'Являясь одной из самых маленьких частей света (немногим больше Океании), по численности населения Европа '
            'занимает третье место после Африки и Азии. На ее территории расположено 65 стран, из которых 50 – '
            'независимые государства. Остальные являются зависимыми территориями или непризнанными республиками. '
            'Почти половина европейских стран (25) являются членами НАТО, 27 государств объединены в Европейский Союз.',
    'countries': {
        'AUT': {
            'name': 'Австрия',
            'capital': 'Вена',
            'flag': 'source\\flags\\eur\\austria.png',
            'text': 'История Название государства происходит из древненемецкого и в переводе означает «восточная '
                    'страна». Флаг Австрии — один из древнейших в мире. Два цвета, красный и белый, символизируют кровь'
                    ' борцов за независимость республики и реку Дунай.',
        },
        'ALB': {
            'name': 'Албания',
            'capital': 'Тирана',
            'flag': 'source\\flags\\eur\\albania.png',
            'text': 'Флаг Албании - единственный в мире национальный флаг с двуглавым орлом. Орел является символом '
                    'храбрости и силы и использовался в албанской геральдике на протяжении веков. В Албании растет '
                    'самое старое в мире живое оливковое дерево, которому более 2 000 лет.',
        },
        'AND': {
            'name': 'Андорра',
            'capital': 'Андорра-ла-Велья',
            'flag': 'source\\flags\\eur\\andorra.png',
            'text': 'Флаг Андорры очень сильно похож на флаги Чада, Румынии и Молдавии. Все четыре флага имеют '
                    'одинаковую цветовую комбинацию. Все флаги имеют три вертикальных полосы: синюю, желтую и красную. '
                    'Флаги Андорры и Молдовы имеют национальный герб на флаге и это действительно единственный способ '
                    'их отличить.',
        },
        'BLR': {
            'name': 'Беларусь',
            'capital': 'Минск',
            'flag': 'source\\flags\\eur\\belarus.png',
            'text': 'Орнамент, размещенный на флаге, был вышит в 1917 г. крестьянкой из деревни Костелище Сенненского '
                    'района Витебской области Матреной Маркевич.',
        },
        'BEL': {
            'name': 'Бельгия',
            'capital': 'Брюссель',
            'flag': 'source\\flags\\eur\\belgium.png',
            'text': 'Если перевернуть Бельгийский флаг, он будет похож на немецкий государственный символ, однако его '
                    'значение совершенно другое. Черный – сила бельгийского народа, желтый – мудрость и зрелость, '
                    'красный цвет – храбрость и мужественность жертв, которые были принесены за суверенитет и '
                    'независимость территории Бельгии.',
        },
        'BGR': {
            'name': 'Болгария',
            'capital': 'София',
            'flag': 'source\\flags\\eur\\bulgaria.png',
            'text': 'Белые и красные цвета болгарского флага происходят от флага России. Эти цвета использовались '
                    'Болгарией с 1878 года, со времен русско-турецкой войны. Зеленая полоса заменена на синюю полосу, '
                    'потому что Болгария стала аграрной страной после обретения независимости от Османской империи в '
                    '1878 году.',
        },
        'BIH': {
            'name': 'Босния и Герцеговина',
            'capital': 'Сараево',
            'flag': 'source\\flags\\eur\\bosnia-hercegovina.png',
            'text': 'Во всех флагах использовались одни и те же цвета: голубой — цвет Организации Объединённых Наций, '
                    'но он был заменён на более тёмный. Белые звёзды символизируют Европу. Жёлтый равнобедренный '
                    'треугольник символизирует три основные группы населения страны (босняков, хорватов и сербов) и '
                    'очертания страны на карте.',
        },
        'VAT': {
            'name': 'Ватикан',
            'capital': 'Ватикан',
            'flag': 'source\\flags\\eur\\vatican.png',
            'text': 'Флаг был создан по образцу флага Папской области (образца 1808 года) и представляет собой '
                    'квадратное полотнище, состоящее из двух равновеликих вертикальных полос — жёлтой и белой. В центре'
                    ' белой полосы — два скрещённых ключа под папской тиарой. Ключи на флаге символизируют ключи '
                    'Царства Небесного.',
        },
        'GBR': {
            'name': 'Великобритания',
            'capital': 'Лондон',
            'flag': 'source\\flags\\eur\\great-britain.png',
            'text': 'Красный крест символ на переднем плане символ св. Георгия-покровителя Англии. Синее прямоугольное '
                    'полотно с белым крестом символ св. Андрея- покровителя Шотландии. Второй красный крест на заднем '
                    'плане символ св. Патрика - покровителя Ирландии.',
        },
        'HUN': {
            'name': 'Венгрия',
            'capital': 'Будапешт',
            'flag': 'source\\flags\\eur\\hungary.png',
            'text': 'Происходит от гербовых (ливрейных) цветов герба Венгрии. Красный цвет символизирует кровь '
                    'венгерских патриотов, пролитую в борьбе за независимость Венгрии. Белый цвет — символ нравственной'
                    ' чистоты и благородства идеалов венгерского народа. Зелёный цвет — символ надежды на лучшее '
                    'будущее страны.',
        },
        'DEU': {
            'name': 'Германия',
            'capital': 'Берлин',
            'flag': 'source\\flags\\eur\\germany.png',
            'text': 'Цвета немецкого флага в настоящее время обозначают объединение Германии. С 1935 по 1945 год '
                    'немецким флагом официально признавался красный фон с черной свастикой в его середине на белом '
                    'круге. Бывший флаг Восточной Германии (1959 до 1989) заключал в себе коммунистические эмблемы.',
        },
        'GRC': {
            'name': 'Греция',
            'capital': 'Афины',
            'flag': 'source\\flags\\eur\\greece.png',
            'text': 'Белый цвет на греческом флаге — облака, синий — небо.',
        },
        'DNK': {
            'name': 'Дания',
            'capital': 'Копенгаген',
            'flag': 'source\\flags\\eur\\denmark.png',
            'text': 'Датчане назвали свой флаг Даннеброг — «земля датчан». Современный флаг скорее напоминает квадрат, '
                    'чем прямоугольник из-за своих размеров — 28:37. Датский флаг стал основой рыцарского ордена '
                    'Даннеброг, который до сих пор вручается в Дании.',
        },
        'IRL': {
            'name': 'Ирландия',
            'capital': 'Дублин',
            'flag': 'source\\flags\\eur\\ireland.png',
            'text': 'Зеленый цвет на флаге символизирует гэльские и англо-норманские традиции Ирландии, связанные с '
                    'католицизмом, оранжевый отражает протестантские традиции, а белый – примирение между ними. '
                    'Государственный герб – арфа.',
        },
        'ISL': {
            'name': 'Исландия',
            'capital': 'Рейкьявик',
            'flag': 'source\\flags\\eur\\iceland.png',
            'text': 'Скандинавский крест – это символ христианства. Такое же значение он имеет и на флагах других стран'
                    ' Скандинавии. Синий цвет символизирует Атлантический океан, омывающий Исландию со всех сторон. '
                    'Белый цвет – символ снегов и льда, так как Исландия – одна из самых северных стран мира.',
        },
        'ESP': {
            'name': 'Испания',
            'capital': 'Мадрид',
            'flag': 'source\\flags\\eur\\spain.png',
            'text': 'Местные жители называют государственный флаг «рохигуальда» — в дословном переводе «красно-желтый».'
                    ' Красный — кровь испанцев, проливаемая в сражениях и во время корриды. Желтый — солнце и песок. '
                    'Красный и желтый — оттенки, дошедшие до нас еще со времен кастильских и арагонских правителей, '
                    'которые использовали их на своих знаменах.',
        },
        'ITA': {
            'name': 'Италия',
            'capital': 'Рим',
            'flag': 'source\\flags\\eur\\italy.png',
            'text': 'Согласно общепринятой версии значение цветов такое: зеленый символизирует надежду, белый — '
                    'традиционно считают цветом веры, а красный олицетворяет любовь. Сами итальянцы иронизируют, что '
                    'раскраска их флага — просто дань национальной кухне: красный — это томаты, белый — сыр моцарелла, '
                    'а зеленый — салат.',
        },
        'RKS': {
            'name': 'Косово',
            'capital': 'Приштина',
            'flag': 'source\\flags\\eur\\xk.png',
            'text': 'Шесть серебряных пятиконечных звёзд символизируют шесть народов, проживающих на территории '
                    'Республики — албанцев, бошняков, горанцев, сербов, турок и цыган.',
        },
        'LVA': {
            'name': 'Латвия',
            'capital': 'Рига',
            'flag': 'source\\flags\\eur\\latvia.png',
            'text': 'Две полосы ярко-багрового цвета, что символизирует кровь, которую на протяжении многих веков '
                    'проливали латышские воины за свободу своего народа. Белая полоса посередине означает честь, '
                    'справедливость и достоинство латышей, а также их права и закон. Цвета и внешний вид флага были '
                    'утверждены в 1994 году.',
        },
        'LTU': {
            'name': 'Литва',
            'capital': 'Вильнюс',
            'flag': 'source\\flags\\eur\\lithuania.png',
            'text': 'Жёлтый цвет символизирует свет и солнце, зелёный — траву, красный — кровь, пролитую за Литву.',
        },
        'LIE': {
            'name': 'Лихтенштейн',
            'capital': 'Вадуц',
            'flag': 'source\\flags\\eur\\liechtenstein.png',
            'text': 'В 1937 году главой правительства княжества Йосифом Хопом было дано официальное толкования символов'
                    ' флага: Синий — цвет сияющего неба, красный — цвет тлеющих угольков в камине, золотой цвет короны'
                    ' показывает нашему народу, что страна и княжеская семья объединены сердцем и духом.',
        },
        'LUX': {
            'name': 'Люксембург',
            'capital': 'Люксембург',
            'flag': 'source\\flags\\eur\\luxembourg.png',
            'text': 'Красный – это мужество, храбрость, стойкость, кровь борцов за свободу. Белый цвет – это серебро, '
                    'то есть символ чистоты, благородства, открытости, невинности, мира и т. п. Лазурный цвет обычно '
                    'означает небо, красоту, честь и честность, духовность.',
        },
        'MLT': {
            'name': 'Мальта',
            'capital': 'Валлетта',
            'flag': 'source\\flags\\eur\\mt.png',
            'text': 'По традиции, белый цвет обозначает свободу, а красный – кровь мужественных защитников своей '
                    'страны. Особое значение имеет изображенный на знамени Георгиевский крест – награда за отвагу, '
                    'присуждаемая гражданским лицам.',
        },
        'MDA': {
            'name': 'Молдавия',
            'capital': 'Кишинёв',
            'flag': 'source\\flags\\eur\\moldova.png',
            'text': 'Желтый цвет в геральдике означает золото, это цвет солнца, света, интеллигенции, престижа. Красный'
                    ' – цвет огня и крови, любви, смелости и жертвенности, желании служить родине. Триколор стал '
                    'официальным флагом Молдовы 30 лет назад решением первого парламента страны.',
        },
        'MCO': {
            'name': 'Монако',
            'capital': 'Монако',
            'flag': 'source\\flags\\eur\\monaco.png',
            'text': 'Символика Согласно древним традициям геральдики, белый цвет обозначает чистоту, а алый – храбрость'
                    ' и мужество защитников своей страны. Дизайн красно-белого полотнища является отсылкой к гербу '
                    'князей рода Гарибальди, правивших Монако с эпохи Средних веков.',
        },
        'NLD': {
            'name': 'Нидерланды',
            'capital': 'Амстердам',
            'flag': 'source\\flags\\eur\\netherlands.png',
            'text': 'Флаг Нидерландов или голландский флаг очень похож на флаг Люксембурга. Хотя в 1992 году голубая '
                    'полоса флага Люксембурга была сделана более светлой, многие считают, что этого было недостаточно, '
                    'чтобы однозначно отличить флаг Люксембурга от флага Нидерландов.',
        },
        'NOR': {
            'name': 'Норвегия',
            'capital': 'Осло',
            'flag': 'source\\flags\\eur\\norway.png',
            'text': 'Красный – это кровь, которую настоящие патриоты проливали за независимость и честь страны; белый '
                    'символизирует непорочную чистоту и надежду на мирное существование всех держав; синий '
                    'свидетельствует о том, что Норвегия принадлежит к морским державам.',
        },
        'POL': {
            'name': 'Польша',
            'capital': 'Варшава',
            'flag': 'source\\flags\\eur\\poland.png',
            'text': 'История Цвета флага соответствуют цветам государственного герба: белый — белому орлу, красный цвет'
                    ' — фону герба. В геральдике белый цвет (серебро) обозначает нравственные, духовные ценности и '
                    'безукоризненную чистоту; красный цвет — символ огня, мужества и отваги.',
        },
        'PRT': {
            'name': 'Португалия',
            'capital': 'Лиссабон',
            'flag': 'source\\flags\\eur\\portugal.png',
            'text': 'Зелёный цвет — символ надежды, путешествий и открытия новых земель, напоминание о временах Генриха'
                    ' Мореплавателя (его личный цвет), красный — символ революции.',
        },
        'MKD': {
            'name': 'Республика Македония',
            'capital': 'Скопье',
            'flag': 'source\\flags\\eur\\north-macedonia.png',
            'text': 'Флаг олицетворяет «новое солнце свободы» (макед. ново сонце на слободата), воспетое в национальном'
                    ' гимне Северной Македонии. Флаг, созданный Мирославом Грчевым, был принят в 1995 году.',
        },
        'RUS': {
            'name': 'Россия',
            'capital': 'Москва',
            'flag': 'source\\flags\\eur\\russia.png',
            'text': 'В настоящее время чаще всего (неофициально) используется следующая трактовка значений цветов флага'
                    ' России: белый цвет означает мир, чистоту, непорочность, совершенство; синий - цвет веры и '
                    'верности, постоянства; красный цвет символизирует энергию, силу, кровь, пролитую за Отечество.',
        },
        'ROU': {
            'name': 'Румыния',
            'capital': 'Бухарест',
            'flag': 'source\\flags\\eur\\romania.png',
            'text': 'Цветам национального Флага Румынии соответствуют следующие понятия: Синий цвет — Свобода '
                    '(Libertate); Жёлтый цвет — Закон (Dreptate); Красный цвет — Братство (Frăție).',
        },
        'SMR': {
            'name': 'Сан-Марино',
            'capital': 'Сан-Марино',
            'flag': 'source\\flags\\eur\\san-marino.png',
            'text': ' центр флага помещено изображение герба Сан-Марино — щита с изображением трёх башен — Гуаита, '
                    'Честа и Монтале, окружённого ветвями дуба и лавра. Щит венчает корона, снизу расположена лента с '
                    'девизом Сан-Марино — «Libertas» (Свобода). Гражданский флаг отличается от официального тем, что не'
                    ' содержит герб в центре.',
        },
        'SRB': {
            'name': 'Сербия',
            'capital': 'Белград',
            'flag': 'source\\flags\\eur\\serbia.png',
            'text': 'Красный олицетворяет мужество сербов в судьбоносных исторических событиях: сражениях и битвах за '
                    'родину; синий символизирует честность и целомудрие жителей Сербии; белый означает миролюбивость и'
                    ' благородство сербов.',
        },
        'SVK': {
            'name': 'Словакия',
            'capital': 'Братислава',
            'flag': 'source\\flags\\eur\\slovakia.png',
            'text': 'Крест на гербе представляет православное христианство, а три горы символизируют горные районы '
                    'Татра, Фатра и Матра по всей стране. Синий, белый и красный являются традиционными славянскими '
                    'цветами и вместе они составляют пан-славянские цвета.',
        },
        'SVN': {
            'name': 'Словения',
            'capital': 'Любляна',
            'flag': 'source\\flags\\eur\\slovenia.png',
            'text': 'В гербе изображены силуэт высочайшей горы Словении — Триглава, три жёлтые звезды на синем поле, '
                    'взятые из герба графов Цельских, и символически изображённые Адриатическое море и реки Словении.',
        },
        'TUR': {
            'name': 'Турция',
            'capital': 'Анкара',
            'flag': 'source\\flags\\eur\\turkey.png',
            'text': 'Значение и история флага Турции: Полумесяц и звезда символизируют ислам. Красный фон турецкого '
                    'флага ведёт начало от Умара, правителя Арабского халифата в 634-644 г. и завоевателя Палестины, '
                    'Египта и Месопотамии.',
        },
        'UKR': {
            'name': 'Украина',
            'capital': 'Киев',
            'flag': 'source\\flags\\eur\\ukraine.png',
            'text': 'Цвета можно толковать так: синий – чистое небо, символ мира, желтый – пшеничное поле, символ '
                    'богатства Украины. В разное время порядок расположения цветов менялся.',
        },
        'FIN': {
            'name': 'Финляндия',
            'capital': 'Хельсинки',
            'flag': 'source\\flags\\eur\\finland.png',
            'text': 'Финский флаг, отражающий «синеву наших озер и белый снег нашей зимы», был официально закреплен в '
                    '1918 г. Финский флаг – «синева наших озер и белый снег нашей зимы». Так охарактеризовал известный'
                    ' поэт в 1870 году эти символические цвета.',
        },
        'FRA': {
            'name': 'Франция',
            'capital': 'Париж',
            'flag': 'source\\flags\\eur\\france.png',
            'text': 'Официальная версия французского правительства гласит, что белый цвет был цветом королей, а синий и '
                    'красный — городскими цветами Парижа. Кроме того, цвета французского флага могут означать '
                    'национальный девиз: liberté (свобода — синий), égalité (равенство — белый) и fraternité (братство '
                    '— красный).',
        },
        'HRV': {
            'name': 'Хорватия',
            'capital': 'Загреб',
            'flag': 'source\\flags\\eur\\hr.png',
            'text': 'Существует неофициальная интерпретация цветов государственного флага: каждый цвет представляет '
                    'символ - красный представляет кровь хорватских мучеников, белый символизирует мирное время в '
                    'Хорватии и природу, синий же представляет преданность хорватского народа Богу.',
        },
        'MNE': {
            'name': 'Черногория',
            'capital': 'Подгорица',
            'flag': 'source\\flags\\eur\\montenegro.png',
            'text': 'Двуглавый орел выступает символом единства государственной власти и церкви, щит со львом '
                    'символизирует епископскую власть, которая сохранялась в государстве на протяжении 3 веков.',
        },
        'CZE': {
            'name': 'Чехия',
            'capital': 'Прага',
            'flag': 'source\\flags\\eur\\czech-republic.png',
            'text': 'Есть версия, согласно которой красный цвет является символом пролитой патриотами родины крови, '
                    'белый символизирует чистоту помыслов и миролюбивость, а синий обозначает небо без облаков над '
                    'страной и ясные горизонты.',
        },
        'CHE': {
            'name': 'Швейцария',
            'capital': 'Берн',
            'flag': 'source\\flags\\eur\\switzerland.png',
            'text': 'С XIV века белый крест на красном фоне является знаменем швейцарских солдат. После основания '
                    'федеративного государства в 1848 году белый крест на красном квадрате стал официальным '
                    'государственным флагом Швейцарии.',
        },
        'SWE': {
            'name': 'Швеция',
            'capital': 'Стокгольм',
            'flag': 'source\\flags\\eur\\sweden.png',
            'text': 'Желтый цвет креста означает щедрость. Синий — символизирует преданность, искренность и '
                    'справедливость шведов.',
        },
        'EST': {
            'name': 'Эстония',
            'capital': 'Таллин',
            'flag': 'source\\flags\\eur\\estonia.png',
            'text': 'Синий — цвет неба, озёр и моря Эстонии; символизирует верность национальным идеям чёрный — цвет '
                    'родной земли и национальных эстонских пиджаков; отражение всех тягот эстонского народа белый — '
                    'цвет снежных равнин Эстонии; олицетворяет человеческое счастье, стремление к свободе и надежду на '
                    'лучшее будущее.',
        },
    }
}

asia = {
    'text': 'Эта часть света является колыбелью двух наиболее древних цивилизаций: индской и шумерской. До окончания '
            'Второй мировой войны году практически все азиатские страны были колониями Великобритании, Франции, '
            'Испании, США. Начавшийся после 1945 года процесс деколонизации привел к созданию на ее территории '
            'независимых государств, пять из которых сегодня входят в ТОП-10 великих мировых держав.',
    'countries': {
        'AZE': {
            'name': 'Азербайджан',
            'capital': 'Баку',
            'flag': 'source\\flags\\asia\\azerbaijan.png',
            'text': 'олубой цвет на Государственном флаге Азербайджанской Республики показывает тюркское происхождение'
                    ' азербайджанского народа, красный цвет отражает желание построить современное общество, развивать'
                    ' демократию, а зеленый цвет указывает на принадлежность к исламской цивилизации.',
        },
        'ARM': {
            'name': 'Армения',
            'capital': 'Ереван',
            'flag': 'source\\flags\\asia\\armenia.png',
            'text': 'Красный цвет символизирует Армянское нагорье, постоянную борьбу армянского народа за '
                    'существование, христианскую веру, свободу и независимость Армении. Синий цвет символизирует '
                    'стремление армянского народа жить под мирным небом. Оранжевый цвет символизирует созидательный '
                    'талант и трудолюбие армянского народа.',
        },
        'AFG': {
            'name': 'Афганистан',
            'capital': 'Кабул',
            'flag': 'source\\flags\\asia\\afganistan.png',
            'text': 'Чёрный символизирует тёмное прошлое, красный — кровь, пролитую в борьбе за независимость, а '
                    'зелёный — процветание сельского хозяйства.',
        },
        'BGD': {
            'name': 'Бангладеш',
            'capital': 'Дакка',
            'flag': 'source\\flags\\asia\\bangladesh.png',
            'text': 'Зелёный цвет символизирует ислам, однако по другим источникам он символизирует растительность '
                    'страны, красный круг — восходящее солнце как символ независимости.',
        },
        'BHR': {
            'name': 'Бахрейн',
            'capital': 'Манама',
            'flag': 'source\\flags\\asia\\bahrejn.png',
            'text': 'Пять белых треугольников, образованных зигзагом на границе белой и красной частей флага, '
                    'символизирую пять столпов ислама: символ веры, пятикратную ежедневную молитву (намаз), пост в '
                    'месяц Рамадан, паломничество в Мекку, раздачу милостыни.',
        },
        'BRN': {
            'name': 'Бруней',
            'capital': 'Бандар-Сери-Бегаван',
            'flag': 'source\\flags\\asia\\brunei.png',
            'text': 'Жёлтый цвет на флаге Брунея является традиционным. Мачта, птичьи крылья, зонт и вымпел — символы '
                    'власти. Кисти рук олицетворяют заботу о благосостоянии народа. Арабская надпись на полумесяце '
                    'гласит: «Вечное служение Аллаху».',
        },
        'BTN': {
            'name': 'Бутан',
            'capital': 'Тхимпху',
            'flag': 'source\\flags\\asia\\butan.png',
            'text': 'Оранжевый цвет – цвет буддизма, в то время как желтый – символ королевской власти, теократической '
                    'монархии. Флаг демонстрирует единение религии и монархии. Дракон – символ Бутана, «Земли Дракона».',
        },
        'VNM': {
            'name': 'Вьетнам',
            'capital': 'Ханой',
            'flag': 'source\\flags\\asia\\vjetnam.png',
            'text': 'Звезда олицетворяет лидерство Коммунистической партии Вьетнама, красный цвет означает успех '
                    'революции, а пять концов звезды иногда трактуются как рабочие, крестьяне, солдаты, интеллигенция и'
                    ' молодёжь. С 1976 года, когда Южный Вьетнам официально объединился с Северным, — флаг '
                    'Социалистической Республики Вьетнам.',
        },
        'GEO': {
            'name': 'Грузия',
            'capital': 'Тбилиси',
            'flag': 'source\\flags\\asia\\georgia.png',
            'text': 'зображённые на государственном флаге Грузии один прямоугольный крест и по углам четыре малых '
                    'креста на серебряном (белом) фоне являются общехристианским символом, олицетворяющим Иисуса '
                    'Христа-Спасителя и четырёх евангелистов.',
        },
        'EGY': {
            'name': 'Египет',
            'capital': 'Каир',
            'flag': 'source\\flags\\asia\\egypt.png',
            'text': 'Красный цвет символизирует борьбу с колониальным режимом, белый — «бескровную» революцию 1952 '
                    'года, чёрный — окончание гнёта британского колониального режима. Золотой орёл — символ Саладина '
                    '(Салах ад-Дин), египетского султана, возглавившего в XII веке борьбу с крестоносцами.',
        },
        'ISR': {
            'name': 'Израиль',
            'capital': 'Иерусалим',
            'flag': 'source\\flags\\asia\\israel.png',
            'text': 'Полотнище флага напоминает талит — белую с синими полосами еврейскую молитвенную накидку. '
                    'Гексаграмма в центре — Маген Давид, известный как «Щит Давида», или «звезда Давида».',
        },
        'IND': {
            'name': 'Индия',
            'capital': 'Нью-Дели',
            'flag': 'source\\flags\\asia\\india.png',
            'text': 'В центре белой полосы расположено синее колесо - символ чакры. Оно выглядит так же, как колесо на '
                    'верхней части сарнатхской Львиной капители Ашоки. Диаметр примерно равен ширине белой полосы, у '
                    'колеса 24 спицы. Флаг был одобрен Учредительным Собранием Индии 22 июля 1947 года.',
        },
        'JOR': {
            'name': 'Иордания',
            'capital': 'Амман',
            'flag': 'source\\flags\\asia\\jordan.png',
            'text': 'Цвет полос флага символизирует три калифата Иордании: черная полоса – династия Абассидов, белая – '
                    'династия Омейядов и зеленая – династия Фатимидов. Красный цвет треугольника - это символ правящей '
                    'династии Хашмитов. Также это символ арабского сопротивления.',
        },
        'IRQ': {
            'name': 'Ирак',
            'capital': 'Багдад',
            'flag': 'source\\flags\\asia\\iraq.png',
            'text': 'Красный цвет символизирует неистовство борьбы против врагов ислама (по другой версии, красный цвет'
                    ' — символ арабской религии до принятия ислама), белый цвет символизирует великодушие и '
                    'благородство арабов (единство и победу арабов), а чёрная полоса означает великое прошлое арабов '
                    '(траур по погибшим героям).',
        },
        'IRN': {
            'name': 'Иран',
            'capital': 'Тегеран',
            'flag': 'source\\flags\\asia\\iran.png',
            'text': 'Флаг Ирана отражает изменения, через которые прошёл Иран с начала Исламской революции и состоит'
                    ' из трёх равных горизонтальных полос: зелёной, белой и красной. Зелёный цвет олицетворяет '
                    'плодородие, порядок и радость, белый — мир, красный — мужество и пролитую на войне кровь.',
        },
        'YEM': {
            'name': 'Йемен',
            'capital': 'Сана',
            'flag': 'source\\flags\\asia\\yemen.png',
            'text': 'Полоса красного цвета на флаге символизирует кровь, пролитую за свободу и независимость страны. '
                    'Белый цвет – это символ светлого и благополучного будущего для всего народа и страны, а черный, '
                    'напротив, означает темное и мрачное прошлое государства.',
        },
        'KAZ': {
            'name': 'Казахстан',
            'capital': 'Астана',
            'flag': 'source\\flags\\asia\\kazakhstan.png',
            'text': 'Флаге Казахстана он символизирует чистое небо, мир и благополучие, а одноцветие фона – единство '
                    'страны. Исходя из геральдических канонов, солнце символизирует богатство и изобилие, жизнь и '
                    'энергию. Поэтому лучи солнца на флаге страны имеют форму зерна – символа достатка и благополучия.',
        },
        'KHM': {
            'name': 'Камбоджа',
            'capital': 'Пномпень',
            'flag': 'source\\flags\\asia\\kh.png',
            'text': 'Синий цвет флага символизирует монархическую власть, красный — народ, белый — религию (буддизм и '
                    'брахманизм). Храм Ангкор символизирует Вселенную, высшие божественные силы и королевскую власть '
                    '(согласно камбоджийской традиции, монарх является посредником между божествами и людьми).',
        },
        'QAT': {
            'name': 'Катар',
            'capital': 'Доха',
            'flag': 'source\\flags\\asia\\qatar.png',
            'text': 'Белый цвет – это символ мира. Бордовый цвет – символ пролитой во время разнообразных войн крови'
                    ' катарцев. Девять треугольников в зигзаге означают, что Катар девятым присоединился к перемирию в '
                    'Персидском заливе.',
        },
        'CYP': {
            'name': 'Кипр',
            'capital': 'Никосия',
            'flag': 'source\\flags\\asia\\cyprus.png',
            'text': 'Белый цвет символизирует мир и спокойствие в стране, оливковые ветви в нижней части флага Кипра '
                    'олицетворяют две основных этнических группы населения острова (грека-киприотов и '
                    'турко-киприотов), а их соединение – надежду на мир и согласие между двумя народностями, '
                    'проживающими в одной стране.',
        },
        'KGZ': {
            'name': 'Киргизия',
            'capital': 'Бишкек',
            'flag': 'source\\flags\\asia\\kirgisia.png',
            'text': 'Красная одноцветность флага символизирует доблесть и смелость, золотое солнце, купающееся в своих'
                    ' лучах, олицетворяет покой и богатство, а тюндюк является символом отчего дома, а в более широком'
                    ' понимании — и мира как вселенной. 40 лучей, объединенных в круг, означают объединение 40 древних'
                    ' племен в единый Кыргызстан.',
        },
        'CHN': {
            'name': 'Китай',
            'capital': 'Пекин',
            'flag': 'source\\flags\\asia\\china.png',
            'text': 'Красный цвет флага символизирует революцию. На нем изображены пять пятиконечных звезд яркого '
                    'желтого цвета-одна большая и четыре маленьких. Маленькие звезды окружают большую, что '
                    'символизирует великое сплочение революционного китайского народа под руководством КПК.',
        },
        'PRK': {
            'name': 'КНДР',
            'capital': 'Пхеньян',
            'flag': 'source\\flags\\asia\\north-korea.png',
            'text': 'Красный цвет — кровь, пролитую корейскими патриотами, силу корейского народа; белый цвет является'
                    ' традиционным для корейцев, он означает чистоту идеалов; синий — стремление к объединению с '
                    'революционными силами всего мира в борьбе за победу социализма и мира, а также независимость КНДР',
        },
        'KWT': {
            'name': 'Кувейт',
            'capital': 'Эль-Кувейт',
            'flag': 'source\\flags\\asia\\kuwait.png',
            'text': 'Белый цвет символизирует стремление к делу, чёрный — поля сражений, зелёный — пастбища и '
                    'государственную религию — ислам, красный — кровь, пролитую в боях с врагами.',
        },
        'LAO': {
            'name': 'Лаос',
            'capital': 'Вьентьян',
            'flag': 'source\\flags\\asia\\laos.png',
            'text': 'Красные цвета флага символизируют кровь, пролитую в борьбе за свободу, синий — богатство, белый'
                    ' означает полнолуние над рекой Меконг — священной рекой народов, живущих в Индокитае.',
        },
        'LBN': {
            'name': 'Ливан',
            'capital': 'Бейрут',
            'flag': 'source\\flags\\asia\\lebanon.png',
            'text': 'В центре флага на белой полосе помещено изображение ливанского кедра зелёного цвета. Красный цвет'
                    ' символизирует кровь, пролитую в борьбе за независимость, белый — чистоту и мир.',
        },
        'MYS': {
            'name': 'Малайзия',
            'capital': 'Путраджайя',
            'flag': 'source\\flags\\asia\\my.png',
            'text': '4 лучей звезды означают единство 13 государств (штатов) с федеральным правительством. Жёлтый цвет'
                    ' является цветом правителей. Сочетание трех основных цветов — красного, белого и синего '
                    'символизирует дружбу Малайзии с Великобританией и единство Малайзии со странами Содружества',
        },
        'MDV': {
            'name': 'Мальдивы',
            'capital': 'Мале',
            'flag': 'source\\flags\\asia\\maldives.png',
            'text': 'Красный цвет флага Мальдив символизирует тех, кто отдал свои жизни, защищая свою страну. '
                    'Зеленый прямоугольник обозначает мир и процветание.',
        },
        'MNG': {
            'name': 'Монголия',
            'capital': 'Улан-Батор',
            'flag': 'source\\flags\\asia\\mongolia.png',
            'text': 'В центре красной полосы, примыкающей к древку, изображён государственный символ «Соёмбо» жёлтого '
                    'цвета. Голубой цвет флага Монголии — цвет безоблачного неба страны. Красный — цвет огня, пламени '
                    'костров в степи, напоминающий о победе национально-освободительной революции в 1921 году.',
        },
        'MMR': {
            'name': 'Мьянма',
            'capital': 'Найпьидо',
            'flag': 'source\\flags\\asia\\myanmar.png',
            'text': 'Три цвета полос флага символизируют солидарность, мир и стабильность, смелость и решительность.',
        },
        'NPL': {
            'name': 'Непал',
            'capital': 'Катманду',
            'flag': 'source\\flags\\asia\\nepal.png',
            'text': 'Синий цвет границы флага символизирует мир, а тёмно-красный — национальный цвет Непала. '
                    'Два королевских символа олицетворяют надежду на то, что Непал будет существовать так же долго, '
                    'как и солнце и луна. А треугольные преобразования флага — символ южной и северной вершин горы '
                    'Эверест, или Джо-Мо-Рлунг-Ма (Джомолунгмы).',
        },
        'ARE': {
            'name': 'Объединённые Арабские Эмираты',
            'capital': 'Абу-Даби',
            'flag': 'source\\flags\\asia\\united-arab-emirates.png',
            'text': 'Зеленый цвет – это плодородие страны; белая полоса символизирует нейтралитет; черная – символ '
                    'главного достояния и богатства страны, коим является нефть; красная полоса – это напоминание об'
                    ' историческом флаге страны.',
        },
        'OMN': {
            'name': 'Оман',
            'capital': 'Маскат',
            'flag': 'source\\flags\\asia\\oman.png',
            'text': 'Белый цвет символизирует мир и процветание, красный — борьбу с иностранными захватчиками, а '
                    'зелёный — плодородие страны и сельское хозяйство.',
        },
        'PAK': {
            'name': 'Пакистан',
            'capital': 'Исламабад',
            'flag': 'source\\flags\\asia\\pakistan.png',
            'text': 'Полумесяц и пятиконечная звезда символизируют прогресс, развитие и свет. Флаг в общих чертах'
                    ' символизирует единство и солидарность мусульманского большинства и религиозных меньшинств. Флаг '
                    'Пакистана является очень популярным среди пакистанцев.',
        },
        'PSE': {
            'name': 'Палестина',
            'capital': 'Восточный Иерусалим',
            'flag': 'source\\flags\\asia\\palestine.png',
            'text': 'Чёрный — цвет Абассидов, белый — цвет Омейядов, красный — цвет хариджитов, завоевателей Андалусии'
                    ' и Хашимитов, зелёный — цвет Фатимидов и ислама. Все четыре цвета известны как панарабские цвета.',
        },
        'KOR': {
            'name': 'Республика Корея',
            'capital': 'Сеул',
            'flag': 'source\\flags\\asia\\south-korea.png',
            'text': 'Белый цвет фона символизирует яркость, чистоту и мир, а инь и ян эмблемы означают первозданную '
                    'гармонию. Четыре триграммы кон, гон, кам и ри символизируют небо, землю, воду и огонь '
                    'соответственно.',
        },
        'SAU': {
            'name': 'Саудовская Аравия',
            'capital': 'Эр-Рияд',
            'flag': 'source\\flags\\asia\\saudi-arabia.png',
            'text': 'Надпись на флаге означает: «Нет бога, кроме Аллаха, и Мухаммад — посланник его»',
        },
        'SGP': {
            'name': 'Сингапур',
            'capital': 'Сингапур',
            'flag': 'source\\flags\\asia\\singapore.png',
            'text': 'Красный цвет олицетворяет всеобщее братство и равенство людей, а белый — чистоту и добродетель.',
        },
        'SYR': {
            'name': 'Сирия',
            'capital': 'Дамаск',
            'flag': 'source\\flags\\asia\\syria.png',
            'text': 'Две звезды означают Египет и Сирию. Зеленый цвет - цвет Фатимидов, белый - Омейядов, черный - '
                    'Аббасидов и красный цвет - кровь мучеников и крови, пролитой в борьбе за независимость.',
        },
        'TJK': {
            'name': 'Таджикистан',
            'capital': 'Душанбе',
            'flag': 'source\\flags\\asia\\tajikistan.png',
            'text': 'В основе флага три цвета: красная полоса символизирует свободу и независимость, белая — мир и '
                    'спокойствие, зеленая — процветание. В центре флага расположена корона с полукругом из семи звезд,'
                    ' обозначающих семь историко-культурных центров Таджикистана.',
        },
        'THA': {
            'name': 'Таиланд',
            'capital': 'Бангкок',
            'flag': 'source\\flags\\asia\\thailand.png',
            'text': 'Символы цветов тайского флага: синий — королевский цвет Рамы VI, учредившего этот флаг; красный '
                    'цвет — цвет нации; белый цвет — цвет религии (всех религий в Таиланде, символ чистоты). ',
        },
        'TWN': {
            'name': 'Тайвань',
            'capital': 'Тайбэй',
            'flag': 'source\\flags\\asia\\taiwan.png',
            'text': 'Красный цвет символизировал самопожертвование и землю Китая, синий - братство, белый - '
                    'справедливость.',
        },
        'TKM': {
            'name': 'Туркменистан',
            'capital': 'Ашхабад',
            'flag': 'source\\flags\\asia\\turkmenustan.png',
            'text': 'Рядом с полосой у верхнего края флага — белый полумесяц и пять белых звёзд. Пять ковровых '
                    'орнаментов (так называемых гёлей) туркменских племён — ахалтеке, йомут, салыр, човдур, эрсары — '
                    'означают пять областей страны.',
        },
        'UZB': {
            'name': 'Узбекистан',
            'capital': 'Ташкент',
            'flag': 'source\\flags\\asia\\uzbekistan.png',
            'text': 'Красные полосы — это жизненные силы, пульсирующие в каждом живом существе, символ жизни. '
                    'Полумесяц соответствует многовековой традиции народа Узбекистана. Полумесяц и звёзды — символ '
                    'безоблачного неба мира. На флаге Узбекистана 12 звёзд.',
        },
        'PHL': {
            'name': 'Филиппины',
            'capital': 'Манила',
            'flag': 'source\\flags\\asia\\philippines.png',
            'text': 'Звезды представляют три островных группы, составляющих Филиппины: Лусон, Висайские острова, '
                    'Минданао. Белый треугольник — символ мира и чистоты, синий и красный — патриотизма и мужества. '
                    'Этот флаг — единственный в мире, на котором цвета меняются местами: в военное время верхняя '
                    'полоса — красная, нижняя — синяя.',
        },
        'JPN': {
            'name': 'Япония',
            'capital': 'Токио',
            'flag': 'source\\flags\\asia\\japan.png',
            'text': 'Флаг представляет собой белое полотно с большим красным кругом в середине, олицетворяющим '
                    'восходящее солнце. Согласно легенде, традиция этого флага берёт начало в XIII веке, со времени '
                    'монгольского вторжения в Японию.',
        }
    }
}

africa = {
    'text': 'Африка занимает 2 место в мире по площади и численности населения после Евразии. По состоянию на 2021 год '
            'на землях Африканского континента расположено 54 независимых государства и 8 зависимых территорий. '
            'Три из них: Лесото, Марокко и Эсватини по государственному устройству монархии, остальные – республики.',
    'countries': {
        'DZA': {
            'name': 'Алжир',
            'capital': 'Алжир',
            'flag': 'source\\flags\\africa\\dz.png',
            'text': 'Белый цвет символизирует чистоту, зелёный цвет — цвет ислама. Полумесяц также является исламским'
                    ' символом. Помимо этого, цвета также символизируют: красный — свободу, зелёный — веру в победу, '
                    'белый — траур по погибшим в борьбе героям.',
        },
        'AGO': {
            'name': 'Ангола',
            'capital': 'Луанда',
            'flag': 'source\\flags\\africa\\angola.png',
            'text': 'Верхняя красная полоса флага сиволизирует кровь, пролитую ангольцами при колониальном угнетении, '
                    'в освободительной борьбе и при защите Отечества. Нижняя черная полоса флага символизирует '
                    'Африканский континент. Сегмент шестерни - символ рабочих и индустриального производства. Мачете - '
                    'символ крестьян, сельскохозяйственного производства и вооруженной борьбы. Звезда символизирует '
                    'международную солидарность и прогресс. Желтый цвет шестерни, мачете и звезды символизирует '
                    'ботаство Анголы.',
        },
        'BEN': {
            'name': 'Бенин',
            'capital': 'Порто-Ново',
            'flag': 'source\\flags\\africa\\benin.png',
            'text': 'Зелёный цвет представляет надежду новой демократии, красный символизирует мужество предков, а '
                    'жёлтый — сокровища нации.',
        },
        'BWA': {
            'name': 'Ботсвана',
            'capital': 'Габороне',
            'flag': 'source\\flags\\africa\\botswana.png',
            'text': 'Голубой цвет на флаге символизирует небо Африки и надежду на воду, в том числе в форме дождя, '
                    'нехватку которой из-за засушливого климата пустыни Калахари испытывает Ботсвана, что также '
                    'выражено в национальном девизе страны: «PULA» — «Да будет дождь». Чёрная полоса — символ '
                    'коренного населения Ботсваны.',
        },
        'BFA': {
            'name': 'Буркина-Фасо',
            'capital': 'Уагадугу',
            'flag': 'source\\flags\\africa\\burkina-faso.png',
            'text': 'Зелёный символизирует сельскохозяйственное богатство народа, достаток, который радует людей. '
                    'Жёлто-золотая звезда символизирует идеологическое руководство народно-демократической революцией '
                    'в её сияющем развитии.',
        },
        'BDI': {
            'name': 'Бурунди',
            'capital': 'Бужумбура',
            'flag': 'source\\flags\\africa\\burundi.png',
            'text': 'Цвета флага символизируют борьбу за независимость (красный), надежду (зелёный) и мир (белый).',
        },
        'GAB': {
            'name': 'Габон',
            'capital': 'Либревиль',
            'flag': 'source\\flags\\africa\\gabon.png',
            'text': 'Дизайн флага отражает географическое положение Габона. Зелёное поле (леса) и синее (Атлантика) '
                    'разделены жёлтой полосой — символом экватора и Солнца.',
        },
        'GMB': {
            'name': 'Гамбия',
            'capital': 'Банжул',
            'flag': 'source\\flags\\africa\\gambia.png',
            'text': 'Красный цвет означает солнце на небе, синий цвет символизирует реку Гамбия, зелёный — землю '
                    'страны.',
        },
        'GHA': {
            'name': 'Гана',
            'capital': 'Аккра',
            'flag': 'source\\flags\\africa\\ghana.png',
            'text': 'Жёлтая полоса — символ богатства минеральными ресурсами, зелёная полоса — символ богатства '
                    'растительными ресурсами, красная полоса — символ крови, пролитой борцами за независимость Ганы.',
        },
        'GIN': {
            'name': 'Гвинея',
            'capital': 'Конакри',
            'flag': 'source\\flags\\africa\\guinea.png',
            'text': 'Красный цвет флага символизирует кровь, пролитую в борьбе за свободу, жёлтый — цвет гвинейского '
                    'золота и солнца, зелёный — африканскую природу. Кроме того, каждый цвет соответствует трём '
                    'словам девиза Гвинеи: красный — «Труд», жёлтый — «Справедливость», зелёный — «Солидарность».',
        },
        'GNB': {
            'name': 'Гвинея-Бисау',
            'capital': 'Бисау',
            'flag': 'source\\flags\\africa\\guinea-bissau.png',
            'text': 'Красный цвет символизировал труд и кровь, пролитую за свободу. Жёлтый символизировал стремление'
                    ' к достойной оплате труда и урожай сельскохозяйственных культур, обеспечивающий благополучие'
                    ' населения. Зелёный отображал растительные богатства природы и надежду на счастливое будущее.',
        },
        'COD': {
            'name': 'Демократическая республика Конго',
            'capital': 'Киншаса',
            'flag': 'source\\flags\\africa\\dr-congo.png',
            'text': 'Голубой цвет символизирует мир. Красный цвет символизирует кровь, пролитую за независимость '
                    'страны. Жёлтый цвет символизирует благополучие страны.',
        },
        'DJI': {
            'name': 'Джибути',
            'capital': 'Джибути',
            'flag': 'source\\flags\\africa\\djibouti.png',
            'text': 'Цвета флага олицетворяют море и небо (синий), землю (зелёный) и мир (белый). Зелёный и синий '
                    'также цвета двух главных групп населения — афары и песа (племена Джибути). Красная звезда — '
                    'память о борьбе за независимость и символ единства.',
        },
        'EGY': {
            'name': 'Египет',
            'capital': 'Каир',
            'flag': 'source\\flags\\asia\\egypt.png',
            'text': 'Красный цвет символизирует борьбу с колониальным режимом, белый — «бескровную» революцию 1952 '
                    'года, чёрный — окончание гнёта британского колониального режима. Золотой орёл — символ Саладина '
                    '(Салах ад-Дин), египетского султана, возглавившего в XII веке борьбу с крестоносцами.',
        },
        'ZMB': {
            'name': 'Замбия',
            'capital': 'Лусака',
            'flag': 'source\\flags\\africa\\zambia.png',
            'text': 'Зелёный цвет символизирует природные богатства. Красный цвет символизирует кровь, пролитую за '
                    'независимость Замбии. Чёрный цвет олицетворяет население Замбии. Оранжевый цвет символизирует'
                    ' богатство страны минеральными ресурсами (прежде всего, медью).',
        },
        'ESH': {
            'name': 'Западная Сахара',
            'capital': 'Эль-Аюн',
            'flag': 'source\\flags\\africa\\western-sahara.png',
            'text': 'Чёрный цвет символизирует смерть. Белый цвет олицетворяет мир. Зелёный цвет символизирует жизнь.',
        },
        'ZWE': {
            'name': 'Зимбабве',
            'capital': 'Хараре',
            'flag': 'source\\flags\\africa\\zimbabwe.png',
            'text': 'Зелёный цвет символизирует сельское хозяйство и сельские районы Зимбабве. '
                    'Жёлтый цвет символизирует богатство полезными ископаемыми. '
                    'Красный цвет олицетворяет кровь, пролитую во время войны за независимость. '
                    'Чёрный цвет олицетворяет наследие и этническую принадлежность коренных африканских '
                    'народов Зимбабве.',
        },
        'CPV': {
            'name': 'Кабо-Верде',
            'capital': 'Прая',
            'flag': 'source\\flags\\africa\\cape-verde.png',
            'text': 'Синий цвет флага символизирует бесконечные просторы неба и океана, белый — мир, красный — '
                    'упорство. 10 звёзд — количество обитаемых островов, окружность — единство государства.',
        },
        'CMR': {
            'name': 'Камерун',
            'capital': 'Яунде',
            'flag': 'source\\flags\\africa\\cameroon.png',
            'text': 'Зелёный цвет символизирует леса в южной части Камеруна; Красный цвет олицетворяет единство севера'
                    ' и юга страны, её государственный суверенитет; Жёлтый цвет символизирует солнце, а также саванны '
                    'в северной части страны.',
        },
        'KEN': {
            'name': 'Кения',
            'capital': 'Найроби',
            'flag': 'source\\flags\\africa\\kenya.png',
            'text': 'Чёрный цвет символизирует африканское население страны. Красный цвет олицетворяет кровь, пролитую'
                    ' во время борьбы за независимость Кении. Зелёный цвет символизирует сельское хозяйство и '
                    'природные богатства страны. Белый цвет символизирует мир.',
        },
        'COM': {
            'name': 'Коморские острова',
            'capital': 'Морони',
            'flag': 'source\\flags\\africa\\km.png',
            'text': 'Четыре полосы символизируют четыре острова архипелага: жёлтый символизирует Мвали, белый '
                    'символизирует Майотту, красный символизирует Анжуан и синий символизирует Гранд-Комор.',
        },
        'CIV': {
            'name': 'Кот-д’Ивуар',
            'capital': 'Ямусукро',
            'flag': 'source\\flags\\africa\\cote-divoire.png',
            'text': 'Оранжевая полоса символизирует саванну и плодородие земли на севере страны, белая — мир и '
                    'единство, зелёная — надежду и леса юга страны.',
        },
        'LSO': {
            'name': 'Лесото',
            'capital': 'Масеру',
            'flag': 'source\\flags\\africa\\lesotho.png',
            'text': 'Цвета символизируют: белый — мир, синий — воду (дождь), зелёный — благосостояние, процветание.',
        },
        'LBR': {
            'name': 'Либерия',
            'capital': 'Монровия',
            'flag': 'source\\flags\\africa\\liberia.png',
            'text': 'Одиннадцать полос обозначают одиннадцать подписей на декларации независимости, причём красный '
                    'цвет символизирует храбрость, а белый — моральные устои.',
        },
        'LBY': {
            'name': 'Ливия',
            'capital': 'Триполи',
            'flag': 'source\\flags\\africa\\libya.png',
            'text': 'Красный цвет — это кровь, которая пролилась в борьбе за свободу Ливии. Чёрный цвет — это память '
                    'о тех днях, когда ливийцы жили в оккупации. Зелёный символизирует светлое будущее страны, а также'
                    ' сельское хозяйство и различные природные богатства. Полумесяц и звезда — символы ислама, главной'
                    ' религии в стране.',
        },
        'MUS': {
            'name': 'Маврикий',
            'capital': 'Порт-Луи',
            'flag': 'source\\flags\\africa\\mu.png',
            'text': 'Красный — независимость; синий — цвет Индийского океана; жёлтый символизирует светлое будущее;'
                    ' зелёный представляет пышную растительность острова.',
        },
        'MRT': {
            'name': 'Мавритания',
            'capital': 'Нуакшот',
            'flag': 'source\\flags\\africa\\mr.png',
            'text': 'Зелёный цвет флага и полумесяц со звездой символизируют ислам, основную религию страны, жёлтый '
                    'цвет полумесяца и звезды — пустыню Сахара.',
        },
        'MDG': {
            'name': 'Мадагаскар',
            'capital': 'Антананариву',
            'flag': 'source\\flags\\africa\\madagascar.png',
            'text': 'Цвета флага символизируют историю Мадагаскара, стремление к независимости и традиционные '
                    'классы общества.',
        },
        'MWI': {
            'name': 'Малави',
            'capital': 'Лилонгве',
            'flag': 'source\\flags\\africa\\malawi.png',
            'text': 'Чёрный цвет символизирует население Африки. Красный цвет олицетворяет кровь, пролитую борцами за '
                    'свободу Африки. Зелёный цвет символизирует неувядающую природу Малави.',
        },
        'MLI': {
            'name': 'Мали',
            'capital': 'Бамако',
            'flag': 'source\\flags\\africa\\mali.png',
            'text': 'Зелёный цвет первой полосы означает надежду, зелень лугов и полей Мали, её почву и всё то, '
                    'что ведёт к повышению благосостояния малийского населения.',
        },
        'MAR': {
            'name': 'Марокко',
            'capital': 'Рабат',
            'flag': 'source\\flags\\africa\\morocco.png',
            'text': 'Красный цвет — цвет шерифов Мекки. Зеленая звезда представляет собой королевский трон, а красный'
                    ' фон представляет собой красную землю. ',
        },
        'MOZ': {
            'name': 'Мозамбик',
            'capital': 'Мапуту',
            'flag': 'source\\flags\\africa\\mozambique.png',
            'text': 'Книга, мотыга и оружие символизируют образование, производство и оборону. Флаг Мозамбика - '
                    'единственный в мире флаг, на котором есть изображение современного оружия - автомата Калашникова.',
        },
        'NAM': {
            'name': 'Намибия',
            'capital': 'Виндхук',
            'flag': 'source\\flags\\africa\\namibia.png',
            'text': 'Считается, что солнце символизирует жизнь и энергию, его золотой цвет — пустыню Намиб и '
                    'минеральные богатства Намибии, синий — небо и Атлантический океан, а также значимость воды в '
                    'засушливом климате. ',
        },
        'NER': {
            'name': 'Нигер',
            'capital': 'Ниамей',
            'flag': 'source\\flags\\africa\\niger.png',
            'text': 'Верхняя оранжевая полоса символизирует пески пустыни Сахара на севере страны, центральная белая '
                    'полоса олицетворяет чистоту и простоту, а нижняя зелёная полоса — надежду и, в то же время,'
                    ' плодородные земли юга Нигера.',
        },
        'NGA': {
            'name': 'Нигерия',
            'capital': 'Абуджа',
            'flag': 'source\\flags\\africa\\nigeria.png',
            'text': 'Зелёные полосы олицетворяют леса и изобилие природных богатств Нигерии, белая полоса '
                    'олицетворяет мир. ',
        },
        'COG': {
            'name': 'Республика Конго',
            'capital': 'Браззавиль',
            'flag': 'source\\flags\\africa\\republic-congo.png',
            'text': 'Зелёный цвет олицетворяет сельское хозяйство и леса Конго, в то время как жёлтый обозначает '
                    '«дружбу и благородство» конголезского народа.',
        },
        'RWA': {
            'name': 'Руанда',
            'capital': 'Кигали',
            'flag': 'source\\flags\\africa\\rwanda.png',
            'text': 'Синяя полоса символизирует счастье и мир, жёлтая — экономическое развитие и минеральные богатства,'
                    ' зелёная — надежду на процветание. Солнце — символ просветления, свободы от незнания и единства.',
        },
        'STP': {
            'name': 'Сан-Томе и Принсипи',
            'capital': 'Сан-Томе',
            'flag': 'source\\flags\\africa\\sao-tome.png',
            'text': 'Красный цвет означает независимость, две звезды черного цвета означают принадлежность к Африке.'
                    ' Желтая полоса символизирует экватор.',
        },
        'SYC': {
            'name': 'Сейшельские острова',
            'capital': 'Виктория',
            'flag': 'source\\flags\\africa\\seychelles.png',
            'text': 'Голубой цвет на флаге изображает небо и море, которые окружают Сейшельские острова, жёлтый — '
                    'солнце, которое предоставляет лёгкость бытия, красный цвет отображает в символической форме '
                    'единство людей и их стремление работать ради мира, единства и любви, белый представляет '
                    'верховенство права, зелёный — землю',
        },
        'SEN': {
            'name': 'Сенегал',
            'capital': 'Дакар',
            'flag': 'source\\flags\\africa\\senegal.png',
            'text': 'Зелёный для мусульман является цветом Пророка, для христиан это — символ надежды, для анимистов '
                    '— символ плодородия. Золото — знак богатства, символизирует плоды труда для народа.',
        },
        'SOM': {
            'name': 'Сомали',
            'capital': 'Могадишо',
            'flag': 'source\\flags\\africa\\somalia.png',
            'text': 'Пять вершин звезды символизируют пять областей, где живут сомалийцы — Джибути, Кения, Эфиопия и '
                    'бывшие Британское Сомали и Итальянское Сомали.',
        },
        'SDN': {
            'name': 'Судан',
            'capital': 'Хартум',
            'flag': 'source\\flags\\africa\\sudan.png',
            'text': 'На флаге Судана красный цвет символизирует борьбу за независимость, белый — мир и свет, а также '
                    'Лигу белого флага (англ.) — народное движение в 1920-х гг. Чёрный цвет символизирует само '
                    'государство Судан (по-арабски Биляд-ас-Судан значит «Страна чёрных») и напоминает о флаге '
                    'махдистов XIX века.',
        },
        'SLE': {
            'name': 'Сьерра-Леоне',
            'capital': 'Фритаун',
            'flag': 'source\\flags\\africa\\sierra-leone.png',
            'text': 'Зелёный цвет символизирует сельское хозяйство, горы и природные ресурсы, синий — символ надежды,'
                    ' что наступят мирные времена. Белый цвет олицетворяет единство и законность.',
        },
        'TZA': {
            'name': 'Танзания',
            'capital': 'Додома',
            'flag': 'source\\flags\\africa\\tanzania.png',
            'text': 'Зелёный цвет символизирует растительность Танзании. Голубой цвет олицетворяет многочисленные '
                    'озёра и реки страны, а также Индийский океан. Чёрный цвет символизирует коренное африканское '
                    'население. Жёлтый цвет символизирует полезные ископаемые.',
        },
        'TGO': {
            'name': 'Того',
            'capital': 'Ломе',
            'flag': 'source\\flags\\africa\\togo.png',
            'text': 'Красный цвет олицетворяет кровь, которая пролита жителями Того за независимость и которая будет '
                    'пролита сыновьями нации во время защиты целостности и суверенитета Того против любого агрессора.'
                    ' Белый цвет символизирует мир, мудрость, чувство достоинства.',
        },
        'TUN': {
            'name': 'Тунис',
            'capital': 'Тунис',
            'flag': 'source\\flags\\africa\\tunisia.png',
            'text': 'Полумесяц и звезда, изображённые на флаге Туниса, являются традиционными символами ислама, а '
                    'также считаются символами удачи.',
        },
        'UGA': {
            'name': 'Уганда',
            'capital': 'Кампала',
            'flag': 'source\\flags\\africa\\uganda.png',
            'text': 'В центре флага расположен белый круг с изображением национального символа — восточного '
                    'венценосного журавля.',
        },
        'CAF': {
            'name': 'ЦАР',
            'capital': 'Банги',
            'flag': 'source\\flags\\africa\\central-african-republic.png',
            'text': 'Красный цвет символизирует кровь народа страны, кровь, которая была пролита в борьбе за '
                    'независимость, и кровь, которую народ прольёт в случае необходимости страну защитить. Синий цвет'
                    ' символизирует небо и свободу. Белый — мир и достоинство. Зелёный — надежду и веру.',
        },
        'TCD': {
            'name': 'Чад',
            'capital': 'Нджамена',
            'flag': 'source\\flags\\africa\\td.png',
            'text': 'Синий цвет символизирует небо, надежду и воду. Желтый цвет олицетворяет солнце и пустыню в '
                    'северной части страны. Красный цвет символизирует прогресс, единство, а также кровь, пролитую за '
                    'независимость Чада.',
        },
        'GNQ': {
            'name': 'Экваториальная Гвинея',
            'capital': 'Малабо',
            'flag': 'source\\flags\\africa\\gq.png',
            'text': 'Голубой треугольник символизирует море - Атлантический океан. Зеленый цвет символизирует '
                    'растительность, сельское хозяйство Республики. Белый цвет символизирует мир. Красный цвет '
                    'олицетворяет кровь, пролитую борцами за независимость Экваториальной Гвинеи.',
        },
        'ERI': {
            'name': 'Эритрея',
            'capital': 'Асмэра',
            'flag': 'source\\flags\\africa\\eritrea.png',
            'text': 'Красный цвет олицетворяет кровь, пролитую борцами за независимость Эритреи. Синий цвет '
                    'символизирует морские богатства в прибрежных водах страны, а также Красное море. Жёлтый цвет '
                    'символизирует богатство минеральными ресурсами, а также возрождение государственности.',
        },
        'SWZ': {
            'name': 'Королевство Эсватини',
            'capital': 'Мбабене',
            'flag': 'source\\flags\\africa\\eswatini.png',
            'text': 'Красный символизирует былые сражения и борьбу, голубой — мир и стабильность, жёлтый — природные '
                    'ресурсы страны. Чёрно-белая раскраска щита символизирует мирное сосуществование чёрной и белой '
                    'расы.',
        },
        'ETH': {
            'name': 'Эфиопия',
            'capital': 'Аддис-Абеба',
            'flag': 'source\\flags\\africa\\ethiopia.png',
            'text': 'Зелёный олицетворяет плодородие, труд и развитие, жёлтый — надежду, справедливость и равенство, '
                    'красный — жертвенность и героизм во имя свободы и равенства.',
        },
        'ZAF': {
            'name': 'ЮАР',
            'capital': 'Претория',
            'flag': 'source\\flags\\africa\\za.png',
            'text': 'Черный треугольник с желтой каймой как бы «врезается» в красно-бело-синий флаг белых, '
                    'символизируя борьбу черного большинства за свои права, победу в этой многолетней борьбе и '
                    'отвоёванное место под солнцем. При этом зеленые полосы (символизирующие т. н. «цветных») лежат'
                    ' между «черной» и «белой» зонами флага.',
        },
        'SSD': {
            'name': 'Южный Судан',
            'capital': 'Джуба',
            'flag': 'source\\flags\\africa\\south-sudan.png',
            'text': 'Основной элемент эмблемы — орлан-крикун с расправленными крыльями, глядящий на своё правое плечо.'
                    ' Перед ним изображены щит и скрещённые копьё и лопата. В когтях орлан держит свиток с названием '
                    'государства. Над названием государства в нижней части герба располагается с надпись «Justice, '
                    'Liberty, Prosperity».',
        }
    }
}